import React from 'react'
import Masseur from './Masseur'
import styles from './About.module.css'

const AboutPage = () => {
    return (
        <div>
            <section className={styles.us}>
                <h1 className={styles.title}>За нас</h1>
                <p>Човешкото тяло е съвършено. То носи знания и мъдрост и ни насочва как да се грижим за него.
                    Болката и неразположенията са сигнали за почивка и презареждане.
                    Ние сме мястото, където релаксацията е лечебна и спокойна предразполагаща атмосфера, професионален екип,
                    висококачествени материали, етерични масла и аромати на професионални козметични марки.</p>
                <p>Масажите в център за масажи <b>Top Massage</b> премахват болката и физическата тревожност.
                    Те са краткият път към радостта и удоволствието без стрес и напрежение.
                    Масажните терапии, които предлагаме, са съобразени с вашите персонални нужди и симптоми,
                    за да можете да усетите истинската сила и облекчение!</p>
                <p>В студио за масаж <b>Top Massage</b> тялото се чувства у дома си – релаксирано, тонизирано, обновено.
                    Кожата си поема дъх, мускулите и ставите усещат благотворната сила на оздравителната енергия сред екзотични аромати,
                    масла и есенции, които окуражават сетивата да усещат пълноценната наслада от живота.
                    Ние познаваме нуждите на тялото и говорим на неговия език с професионализъм и внимание,
                    затова знаем каква е точната грижа за всеки наш гост. </p>
                <p>Ние сме с вас, когато усетите неразположение или болка в гърба, болка във врата, болка в раменете,
                    болки в ставите, болки в ръцете или краката, за да премахнем оплакванията и да върнем усмивката на лицето ви.
                    Предлагаме различни видове масажи, изпълнени от ловките, но деликатни ръце на добър масажист!</p>
                <p>Доверете се на силата на масажа и запазете час в студио за масаж <b>Top Massage</b>,
                    за да почувствате живителната енергия в собственото си успокоено и тонизирано тяло.
                    Ние ще ви доставим не само удоволствие, но и ще ви подкрепим да постигнете оптимално здраве, баланс и хармония. </p>
            </section>
            <section className={styles.masseurs}>
                <div className={styles.team}>
                    <p><b>Запознайте се с екипа</b></p>
                </div>
                <Masseur
                    imgPath="https://res.cloudinary.com/dfwwzfev2/image/upload/v1637842573/top-massage/masseurs/Mihaela_lvoe9a.jpg"
                    name="Михаела Иванова"
                    position="Мениджър"
                    info="С магистърска степен специалност кинезитерапия, Михаела има дългогодишен опит както кинезитерапевт, консултант, 
                експерт и управител.Нейната сила и страст е в индивидуално диагностициране и прилагане на ефективни масажи
                за превенция и профилактика на Вашето здраве."
                />
                <Masseur
                    imgPath="https://res.cloudinary.com/dfwwzfev2/image/upload/v1637842573/top-massage/masseurs/AnaMaria_gkxl7h.jpg"
                    name="Ана-Мария Христова"
                    position="Масажист терапевт"
                    info="Ана-Мария е завършила Националната спортна академия и има следдипломна квалификация 
                по „Класически, източноазиатски, антицелулитни и козметични масажи“.
                Оттогава тя работи в областта на здравето и красотата и се специализира в различни масажи."
                />
                <Masseur
                    imgPath="https://res.cloudinary.com/dfwwzfev2/image/upload/v1637842573/top-massage/masseurs/Teodora_zoqmtm.jpg"
                    name="Теодора Донева"
                    position="Kинезитерапевт/ Mасажист"
                    info="С опит в сферата на възстановителните процедури, Теодора е магистър по кинезитерапия от Националната спортна академия.
                Тя се радва да помага както на здрави хора, така и на хора с различни здравословни проблеми,
                за да им помогне да укрепят и възстановят здравето си чрез движение.
                Нейната сила е лечебният масаж."
                />
                <Masseur
                    imgPath="https://res.cloudinary.com/dfwwzfev2/image/upload/v1637842573/top-massage/masseurs/Gabriela_i57cxa.jpg"
                    name="Габриела Петков"
                    position="Масажист терапевт и консултант"
                    info="След като завършва Национална Спортна Академия с разширено обучение по различните видове масажи,
                Габриела осъзнава, че нейното признание е да помага на хората.Тя специализира в различни видове масажи - рефлексотерапия,
                класически,ароматерапия, дълбокотъканен, и много други."
                />
            </section>
        </div >
    )
}

export default AboutPage
